<a href="https://colab.research.google.com/github/adamKuzanski/data-science-bootcamp/blob/master/02_Analiza_danych/01_pandas_intro.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

# Podstawowe struktury  danych: pd.Series

In [3]:
s = pd.Series(data = [3, 2, 4, 6])
s

0    3
1    2
2    4
3    6
dtype: int64

In [7]:
s = pd.Series(data = [3, 2, 4, 6], index=['a', 'b', 'c', 'd'], name='Sample')
s

a    3
b    2
c    4
d    6
Name: Sample, dtype: int64

In [10]:
s = pd.Series(data = [3.0, 2, 4, 6], index=['a', 'b', 'c', 'd'], name='Sample')
s

a    3.0
b    2.0
c    4.0
d    6.0
Name: Sample, dtype: float64

In [14]:
import numpy as np

np.nan #brak danych

s = pd.Series(data = [3, np.nan, 4, 6], index=['a', 'b', 'c', 'd'], name='Sample')
s

a    3.0
b    NaN
c    4.0
d    6.0
Name: Sample, dtype: float64

In [17]:
s = pd.Series(data=[True, False, False])
s

0     True
1    False
2    False
dtype: bool

In [18]:
s = pd.Series(data=np.arange(10, 20), index=pd.date_range(start='20200101', periods=10))
s

2020-01-01    10
2020-01-02    11
2020-01-03    12
2020-01-04    13
2020-01-05    14
2020-01-06    15
2020-01-07    16
2020-01-08    17
2020-01-09    18
2020-01-10    19
Freq: D, dtype: int64

In [23]:
s = pd.Series(data=['python', 'java', 'sql'], name='Languages')
print(s)
print()
print(type(s))

0    python
1      java
2       sql
Name: Languages, dtype: object

<class 'pandas.core.series.Series'>

In [35]:
s = pd.Series(data=np.arange(10, 20), index=pd.date_range(start='20200101', periods=10))
s
#print(s.index)
indeksy = list(s.index)
wartosci = list(s.values)
print(wartosci)

print(s.dtypes)

print(s.shape)

[10, 11, 12, 13, 14, 15, 16, 17, 18, 19]
int64
(10,)

In [50]:
price  = pd.Series(data={'Apple': 200, 'CD Projekt': 60, 'Amazon': 1900, 'KGHM': np.nan})
print(price)

print(price['CD Projekt'])
print(price[1])

Apple          200.0
CD Projekt      60.0
Amazon        1900.0
KGHM             NaN
dtype: float64
60.0
60.0

In [60]:
#podstawowe funkcje do analizy danych

print("Ile elementów: ", price.count()) # nie zwróci NaN
print("Ile razy element wystąpił: ", price.value_counts()) # nie zwróci NaN
print("Ile razy element wystąpił: ", price.value_counts(dropna=False)) #ZWRÓCI NaN
print("Suma wartości: ", price.sum())
print("Max: ", price.max())
print()
print("Opisz element zbiorczo: ", price.describe())
print()
print("Top 2 elementy: ", price.nlargest(2))
print("Down 2 elementy: ", price.nsmallest(2))

print("Ranking każdego elementy: ", price.rank())

print("Sortowaie: ", price.sort_values())
print("Sortowaie: ", price.sort_values(ascending=False))

Ile elementów:  3
Ile razy element wystąpił:  1900.0    1
60.0      1
200.0     1
dtype: int64
Ile razy element wystąpił:  NaN       1
1900.0    1
60.0      1
200.0     1
dtype: int64
Suma wartości:  2160.0
Max:  1900.0

Opisz element zbiorczo:  count       3.000000
mean      720.000000
std      1024.304642
min        60.000000
25%       130.000000
50%       200.000000
75%      1050.000000
max      1900.000000
dtype: float64

Top 2 elementy:  Amazon    1900.0
Apple      200.0
dtype: float64
Down 2 elementy:  CD Projekt     60.0
Apple         200.0
dtype: float64
Ranking każdego elementy:  Apple         2.0
CD Projekt    1.0
Amazon        3.0
KGHM          NaN
dtype: float64
Sortowaie:  CD Projekt      60.0
Apple          200.0
Amazon        1900.0
KGHM             NaN
dtype: float64
Sortowaie:  Amazon        1900.0
Apple          200.0
CD Projekt      60.0
KGHM             NaN
dtype: float64

In [64]:
price_pln = price.apply(lambda x: x * 3.8)
print(price_pln)

Apple          760.0
CD Projekt     228.0
Amazon        7220.0
KGHM             NaN
dtype: float64

### **Data Frame**

In [66]:
df = pd.DataFrame(data=[12, 12, 32])
df

    0
0  12
1  12
2  32

In [68]:
df = pd.DataFrame(data=[12, 12, 32], index=['first', 'second', 'third'], columns=['col_1'])
df

        col_1
first      12
second     12
third      32

In [69]:
df = pd.DataFrame(data={'WIG20': ['PKN ORLEN', 'PKO BP'],
                        'mWIG40': ['Amica', 'Playway']})
df

       WIG20   mWIG40
0  PKN ORLEN    Amica
1     PKO BP  Playway

In [70]:
df = pd.DataFrame(data=[[10, 12, 13], [23, 12, 10]], index=['first', 'second'], columns=['col_1', 'col_2', 'col_3'])
df

        col_1  col_2  col_3
first      10     12     13
second     23     12     10

In [82]:
print( df.columns )
print()
print( df.index )
print()
print( df.values )
print()
print( df.info() )
print()
print( df.describe())

Index(['col_1', 'col_2', 'col_3'], dtype='object')

Index(['first', 'second'], dtype='object')

[[10 12 13]
 [23 12 10]]

<class 'pandas.core.frame.DataFrame'>
Index: 2 entries, first to second
Data columns (total 3 columns):
col_1    2 non-null int64
col_2    2 non-null int64
col_3    2 non-null int64
dtypes: int64(3)
memory usage: 144.0+ bytes
None

           col_1  col_2     col_3
count   2.000000    2.0   2.00000
mean   16.500000   12.0  11.50000
std     9.192388    0.0   2.12132
min    10.000000   12.0  10.00000
25%    13.250000   12.0  10.75000
50%    16.500000   12.0  11.50000
75%    19.750000   12.0  12.25000
max    23.000000   12.0  13.00000

In [83]:
print( df.describe().T)

       count  mean       std   min    25%   50%    75%   max
col_1    2.0  16.5  9.192388  10.0  13.25  16.5  19.75  23.0
col_2    2.0  12.0  0.000000  12.0  12.00  12.0  12.00  12.0
col_3    2.0  11.5  2.121320  10.0  10.75  11.5  12.25  13.0

# **Selekcja Kolumn**

In [85]:
df

        col_1  col_2  col_3
first      10     12     13
second     23     12     10

In [88]:
print(df['col_1']) #zostanie zwrócona kolumna, ale w typie series
print(type(df['col_1']))

first     10
second    23
Name: col_1, dtype: int64
<class 'pandas.core.series.Series'>

In [93]:
df[['col_1']] #wyświetlony jako data Frame

        col_1
first      10
second     23

In [98]:
df.columns = ['a', 'b', 'c']
df

         a   b   c
first   10  12  13
second  23  12  10

In [102]:
df.a #nie zawsze praktyczny

first     10
second    23
Name: a, dtype: int64

In [104]:
df['d'] = df.a + df.c
df

         a   b   c   d
first   10  12  13  23
second  23  12  10  33

In [106]:
df = pd.DataFrame(data=[[10, 12, 13], [23, 12, 10]], index=['first', 'second'], columns=['col_1', 'col_2', 'col_3'])
df

        col_1  col_2  col_3
first      10     12     13
second     23     12     10

In [108]:
df.loc['first'] #wycina wiersz po nazwie

col_1    10
col_2    12
col_3    13
Name: first, dtype: int64

In [111]:
df.iloc[0] #wycina wiersz po indeksie

col_1    10
col_2    12
col_3    13
Name: first, dtype: int64

In [114]:
df.loc['first', 'col_2'] #wycina element

12

In [116]:
df.loc[:, 'col_2']

first     12
second    12
Name: col_2, dtype: int64

In [119]:
df.iloc[0, 1] #wycina element

12